{
  "type": "network",
  "version": "1.0",
  "data": "data.json",
  "logo": {
    "file": "",
    "link": "https://wordpress.com/view/victorianwomenwritersdatabase.wordpress.com",
    "text": "Andrea Stewart"
  },
  "text": {
    "more": "In 2015, I began a project to collect biographical, professional, and connectivity information for a subset of what has now become over 700 long nineteenth century British women writers with the idea that a large-scale data analytic approach would reveal a more complete portrait of the Victorian era female author. In addition to having a lifespan touching at least one point in what scholars consider to be “the long nineteenth century,” this specific cohort of women writers was created using a baseline criteria that for inclusion, each individual must have at least one verifiable, signed publication in order to validate their status as both a woman and a writer for the scope of my research.\nFrom the collected biographical data, I used the data visualization software Gephi (version 0.9.2) in 2017 to generate a macro-network di-graph of the familial, social, and professional connections between my writerly cohort with a goal of using this graph as an entry point for studying long-nineteenth century female writers, examining how certain women functioned as highly visible and centrally located “nodes” within publishing networks and working to understand and reveal any new insights could be gained from viewing women’s relationships with each other on a comprehensive scale.\n\nForegrounding the metric of connectivity, rather than the number of texts a writer had produced or an arbitrary notion of canonicity, led to what I argue in previous writing on this subject is a more organic and serendipitous “discovery” of both nodal hotspots and isolations. \n\nThe graph presented here is a translation of that Gephi-produced graph (now version 0.9.7) into a searchable online visualization using the Sigma.js tool and hosted on an open-code service (GitHub).",
    "intro": "A visual representation of the connections (biographical, personal, professional, social, and other) between verifiable British-based women writers of the long nineteenth century.",
    "title": "Women Writers\u0027 Networks in the Long Nineteenth Century (British-based; 1700-2000)"
  },
  "legend": {
    "edgeLabel": "Connections",
    "colorLabel": "# of Connections",
    "nodeLabel": "Author"
  },
  "features": {
    "search": true,
    "groupSelectorAttribute": "color",
    "hoverBehavior": "dim"
  },
  "informationPanel": {
    "groupByEdgeDirection": true,
    "imageAttribute": false
  },
  "sigma": {
    "drawingProperties": {
      "defaultEdgeType": "curve",
      "defaultHoverLabelBGColor": "#002147",
      "defaultLabelBGColor": "#ddd",
      "activeFontStyle": "bold",
      "defaultLabelColor": "#000",
      "labelThreshold": 10,
      "defaultLabelHoverColor": "#fff",
      "fontStyle": "bold",
      "hoverFontStyle": "bold",
      "defaultLabelSize": 14
    },
    "graphProperties": {
      "maxEdgeSize": 0.5,
      "minEdgeSize": 0.2,
      "minNodeSize": 1,
      "maxNodeSize": 7
    },
    "mouseProperties": {
      "maxRatio": 20,
      "minRatio": 0.75
    }
  }
}